Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
/*******************************************************************************
 * \brief	Initialise WG2 mesh parameters.
 *
 * \param   None.
 * \return	None.
 ******************************************************************************/

void Init_Keys(void)
{
	SID = NULL_SID;
	RumorSenderSID = NULL_SID;
	RumorSeqNum = 0;
	ReceivedSeqNum = 99;
	MeshKey[0] = 0;
	MeshKey[1] = 0;
	MeshKey[2] = 0;
	NetworkMeshID = 0;
	LongMsgFirstByte = 0;
	MediumMsgFirstByte = 0;
	Init_Messages();
}



/*******************************************************************************
 * \brief	Get WG2 SID.
 *
 * \param   None.
 * \return	SID value.
 ******************************************************************************/

uint8_t GetSID(void)
{
	return SID;
}



/*******************************************************************************
 * \brief	Get WG2 mesh keys.
 *
 * \param   None.
 * \return	Pinter to mesh keys.
 ******************************************************************************/

uint8_t* GetKeys(void)
{
	return &MeshKey[0];
}



/*******************************************************************************
 * \brief	Initialise radio (Si4461) RAM, GPIOs, and property configuration.
 *
 * \param   None.
 * \return	None.
 ******************************************************************************/

void Init_Radio(void)
{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x01;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    GPIO_PinInit(RADIO_CHIP_SHUTDOWN_GPIO, RADIO_CHIP_SHUTDOWN_GPIO_PIN, &radiochipshutdownConfig);
    GPIO_PinInit(RADIO_CHIP_NIRQ_GPIO, RADIO_CHIP_NIRQ_GPIO_PIN, &radiochipinterruptrequestConfig);
    GPIO_PinInit(RADIO_CHIP_SELECT_GPIO, RADIO_CHIP_SELECT_GPIO_PIN, &radiochipselectConfig);
    GPIO_PinInit(RADIO_CHIP_CTS_GPIO, RADIO_CHIP_CTS_GPIO_PIN, &radiochipcleartosendConfig);
    GPIO_PinInit(SYNC_WORD_DETECT_GPIO, SYNC_WORD_DETECT_GPIO_PIN, &radiochipsyncdetectConfig);
    //GPIO_PinInit(DIRECT_MODE_TX_DATA_GPIO, DIRECT_MODE_TX_DATA_GPIO_PIN, &radiodirectmodetxdataConfig);


    NVIC_EnableIRQ(RADIO_CHIP_NIRQ_IRQ);
    GPIO_PortEnableInterrupts(RADIO_CHIP_NIRQ_GPIO, 1U << RADIO_CHIP_NIRQ_GPIO_PIN);


    NVIC_SetPriority(SYNC_WORD_DETECT_IRQ, SYNC_WORD_DETECT_IRQ_PRIORITY);
    NVIC_EnableIRQ(SYNC_WORD_DETECT_IRQ);

    //GPIO_PortEnableInterrupts(SYNC_WORD_DETECT_GPIO, 1U << SYNC_WORD_DETECT_GPIO_PIN);


    // ABR
    GPIO_PinInit(USER_BUTTON_GPIO, USER_BUTTON_GPIO_PIN, &userbuttoninterruptrequestConfig);
    NVIC_SetPriority(USER_BUTTON_IRQ, USER_BUTTON_IRQ_PRIORITY);
    NVIC_EnableIRQ(USER_BUTTON_IRQ);
    //GPIO_PortEnableInterrupts(USER_BUTTON_GPIO, 1U << USER_BUTTON_GPIO_PIN);


	// Reset radio by driving SDN high then low
    RADIO_SDN_ON;
	Delay(6);									//?msec delay
	RADIO_SDN_OFF;
	Delay(12); 									//?6msec delay


	for(uint8_t i=0;i<64;i++)
	{
		for(uint8_t j=1;j<8;j++)
		{
			RadioTransmitBuffer[j-1] = Patch[i][j];
		}
		Write_RadioCommand(Patch[i][0], 7, 0);
		/*
		do
		{
		  	RadioCTS = Get_RadioCTS();
		}
		while(!RadioCTS);
		*/
		Delay(8);  //////// [RE:fixed] was 4msec
	}


    // Send POWER_UP command to initialise the radio. Ext. Xtal at 30MHz
    //RadioTransmitBuffer[0] = 0x81;
    //RadioTransmitBuffer[1] = 0x00;
    //RadioTransmitBuffer[2] = 0x01;
    //RadioTransmitBuffer[3] = 0xC9;//0x8C
    //RadioTransmitBuffer[4] = 0xC3;//0xBA
    //RadioTransmitBuffer[5] = 0x80;

    //As  per WDS Calculator Current Frequency Value 30Mhz
    //#define RF_POWER_UP 0x02, 0x81, 0x00, 0x01, 0xC9, 0xC3, 0x80

    //As Suggested Changes to 26Mhz
    //#define RF_POWER_UP 0x02, 0x81, 0x00, 0x01, 0x8C, 0xBA, 0x80
    RadioTransmitBuffer[0] = 0x81;
    RadioTransmitBuffer[1] = 0x00;
    RadioTransmitBuffer[2] = 0x01;
    RadioTransmitBuffer[3] = 0x8C;
    RadioTransmitBuffer[4] = 0xBA;
    RadioTransmitBuffer[5] = 0x80;
    Write_RadioCommand(POWER_UP, POWER_UP_COMMAND_LEN, POWER_UP_RESPONSE_LEN);

    while(RadioBusy);
    Read_RadioInterruptStatus();
    if(RadioResponseSuccess)
    {
    	;//PRINTF("Radio POWER_UP initialisation success. \r\n");
    }

    // Send GPIO_PIN_CFG command to initialise the radio
    RadioTransmitBuffer[0] = 0x60;//Pull up and TX_STATE on GPIO0
    RadioTransmitBuffer[1] = 0x48;//Pull up and CTS
    RadioTransmitBuffer[2] = 0x44;//Pull up and TX data in
    RadioTransmitBuffer[3] = 0x5A;//Pull up  and SYNC word detect
    RadioTransmitBuffer[4] = 0x67;
    RadioTransmitBuffer[5] = 0x4B;
    RadioTransmitBuffer[6] = 0x00;
    Write_RadioCommand(GPIO_PIN_CFG, GPIO_PIN_CFG_COMMAND_LEN, NO_RESPONSE_LEN);
    //Use either delay of 1msec, or check CTS. Not both together
    //Delay(2);
    do
    {
      	RadioCTS = Get_RadioCTS();
    }
    while(!RadioCTS);

    //while(RadioBusy);//Does not seem to work
    Read_RadioInterruptStatus();
    if(RadioResponseSuccess)
    {
      	;//PRINTF("Radio GPIO_PIN_CFG initialisation success %d. \r\n",count);
    }

    //'SET_PROPERTIES'
    for(uint8_t list_index = 0; list_index < NO_OF_RADIO_PROPERTIES; list_index++)
    {
         SetRadioProperty(RadioProperty[list_index].group, RadioProperty[list_index].number, RadioProperty[list_index].data);
    }


    Init_Keys();
    GateWayID[0] = 1;
    GateWayID[1] = 2;
    GateWayID[2] = 3;
    UpdateID(&GateWayID[0]);

#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x81;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    //SetRadioProperty (INT_CTL, INT_CTL_ENABLE, NO_INT_EN);
    //GPIO_PortDisableInterrupts(RADIO_CHIP_NIRQ_GPIO, 1U << RADIO_CHIP_NIRQ_GPIO_PIN);
}



/*******************************************************************************
 * \brief   Switch radio transceiver to sleep mode.
 *
 * \param   None.
 * \return  None.
 ******************************************************************************/

