Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
void Sleep_Radio(void)
{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x02;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    ChangeState(SLEEP_STATE);
}



/*******************************************************************************
 * \brief	Write command to radio transceiver.
 *
 * \param   Command. Command to radio.
 * \param	len. Length of command.
 * \param	Rlen. Length of expected command response.
 * \return	None.
 ******************************************************************************/

void Write_RadioCommand(uint8_t command, uint8_t len, uint8_t Rlen)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x03;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t count;
	RadioBusy = true;
	RadioResponseSuccess = false;


    RADIO_NSEL_ON;

	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) command;

    for(count = 0; count < len; count++)
    {
    	while( FRAME_TRANSFER_NOT_COMPLETED )
    	{
    	 	;
    	}
    	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
    	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

    	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) RadioTransmitBuffer[count];
    }


    while( FRAME_TRANSFER_NOT_COMPLETED )
    {
     	;
    }
    LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
    LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);
    RADIO_NSEL_OFF;

    if(Rlen != 0)
    {
    	RadioResponseSuccess = Get_RadioResponse(command,Rlen);
    }
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x83;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

}



/*******************************************************************************
 * \brief	Read radio receive buffer.
 *
 * \param	len. Length of block to be read.
 * \return	None.
 ******************************************************************************/

void ReadRxBuffer(uint8_t len)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x04;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	//RadioBusy = true;

	RADIO_NSEL_ON;

	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) READ_RX_FIFO;

	while( FRAME_TRANSFER_NOT_COMPLETED )
	{
		;
	}

	for(uint8_t count = 0; count < len; count++)
	{
	    LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
	    LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

	    RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) 0x00000000;
	    while( FRAME_TRANSFER_NOT_COMPLETED )
	    {
	     	;
	    }

	    RxData[count] = (uint8_t)(RADIO_LPSPI_MASTER_BASEADDR->RDR);
	}

	RADIO_NSEL_OFF;
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x84;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Read radio interrupt status.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void Read_RadioInterruptStatus(void)
{
    RadioTransmitBuffer[0] = 0x00;
    RadioTransmitBuffer[1] = 0x00;
    RadioTransmitBuffer[2] = 0x00;

    //Write_RadioCommand(GET_INT_STATUS, GET_INT_STATUS_COMMAND_LEN, GET_INT_STATUS_RESPONSE_LEN);
    //With no parameters, all pending interrupts cleared. Saving the time of transmitting 3 bytes
    Write_RadioCommand(GET_INT_STATUS, NO_PARAMETERS, 3);//Only 3rd response byte (PH_PEND) needed for checking
}



/*******************************************************************************
 * \brief	Set radio interrupt status flag.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void Set_RadioInterruptStatus(void)
{
    //ABR added for testing
    //WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x06;

	RadioBusy = false;
}



/*******************************************************************************
 * \brief	Set radio sync detected flag.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void Set_SyncDetected(void)
{
    //ABR added for testing
    //WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] += 0x80;

    SyncDetected = true;
}



/*******************************************************************************
 * \brief	Get radio response to a command.
 *
 * \param	Command. Command to radio.
 * \param	Rlen. Length of command response.
 * \return	None.
 ******************************************************************************/

bool Get_RadioResponse(uint8_t command, uint8_t Rlen)
{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x08;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    bool success = false;
    uint16_t count = 0;
    uint8_t RXdata;


    do
    {
    	RADIO_NSEL_ON;

    	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
    	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

    	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) READ_CMD_BUFF;
    	while( FRAME_TRANSFER_NOT_COMPLETED )
    	{
    		;
    	}
    	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
    	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

    	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) 0x00000000;
    	while( FRAME_TRANSFER_NOT_COMPLETED )
    	{
    	 	;
    	}

        RXdata = (uint8_t)(RADIO_LPSPI_MASTER_BASEADDR->RDR);
        if(RXdata != 0xFF)
        {
        	RADIO_NSEL_OFF;
        }
        else
        {
            success = true;
        }
    }
    while( (count++ < 50) && (RXdata != 0xFF) );



    if(success != false)
    {
        for(uint8_t count = 0; count < Rlen; count++)
        {
        	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
        	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

        	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) 0x00000000;
        	while( FRAME_TRANSFER_NOT_COMPLETED )
        	{
        	 	;
        	}

        	RadioReceiveBuffer[count] = (uint8_t)(RADIO_LPSPI_MASTER_BASEADDR->RDR);
        }
    }

    RADIO_NSEL_OFF;
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x88;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

    return success;
}



