Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
/*******************************************************************************
 * \brief	Write radio property.
 *
 * \param	group. Property group.
 * \param	number. Property number.
 * \param	data. Property value.
 * \return	None.
 ******************************************************************************/

void SetRadioProperty (uint8_t group, uint8_t number, uint8_t data)
{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x09;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    //bool success;

    RadioTransmitBuffer[0] = group;		// Property group
    RadioTransmitBuffer[1] = 0x01;		// No. of properties to write to
    RadioTransmitBuffer[2] = number;	// Property index
    RadioTransmitBuffer[3] = data;		// Data value

    //RadioCTS = Get_RadioCTS();
    //if( RadioCTS )
    do
    {
    	RadioCTS = Get_RadioCTS();
    }
    while(!RadioCTS);

    Write_RadioCommand(SET_PROPERTY, SET_PROPERTY_COMMAND_LEN, SET_PROPERTY_RESPONSE_LEN);
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x89;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Get radio CTS.
 *
 * \param	None.
 * \return	CTS state.
 ******************************************************************************/

bool Get_RadioCTS(void)
{
	//bool success = false;
	//uint16_t count = 0;
	//uint8_t RXdata;

	return (((RADIO_CHIP_CTS_GPIO->DR) >> RADIO_CHIP_CTS_GPIO_PIN) & 0x1U);

/*
	do
	{
	  	RADIO_NSEL_ON;

	   	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
	   	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

	   	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) READ_CMD_BUFF;
	   	while( FRAME_TRANSFER_NOT_COMPLETED )
	   	{
	   		;
	   	}
	   	LPSPI_FlushFifo(RADIO_LPSPI_MASTER_BASEADDR, true, true);
	   	LPSPI_ClearStatusFlags(RADIO_LPSPI_MASTER_BASEADDR, kLPSPI_AllStatusFlag);

	   	RADIO_LPSPI_MASTER_BASEADDR->TDR = (uint32_t) 0x00000000;
	   	while( FRAME_TRANSFER_NOT_COMPLETED )
	   	{
	   	 	;
	   	}

	   	RXdata = (uint8_t)(RADIO_LPSPI_MASTER_BASEADDR->RDR);

	    RADIO_NSEL_OFF;
	}
	while( (count++ < 30) && (RXdata != 0xFF) );

	if(RXdata == 0xFF)
	{
	    success = true;
	}

	return success;
*/
}



/*******************************************************************************
 * \brief	Join a mesh network.
 *
 * \param	None.
 * \return	True, if successfully joined in. False, if failed.
 ******************************************************************************/

bool JoinNetwork(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x0B;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t detections=0;
	bool JoinSuccess;
	bool ReceiveInviteSuccess;
	uint32_t StartTime, CurrentTime;


	Init_Keys();

	JoinSuccess = false;

	ChangeState(READYSTATE);
	//Read_RadioInterruptStatus();
	StartTime = GetCurrentTimerCount();
	do
	{
		ReceiveInviteSuccess = ReceiveInviteMessage();

		if(ReceiveInviteSuccess)
		{
			//Delay(2);
			SendJoinRequestMessage();
			JoinSuccess = ReceiveJoinAckMessage();
			detections++;
		}
		CurrentTime = GetCurrentTimerCount();
	}
	while( (!JoinSuccess) && ((CurrentTime-StartTime)<(uint32_t)(FIVE_SECOND)) );

#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x8B;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	//PRINTF("Number of detections = %d \r\n",detections);
	return JoinSuccess;
}



/*******************************************************************************
 * \brief	Receive invite message.
 *
 * \param	None.
 * \return	True, if invite received successfully. False, if failed.
 ******************************************************************************/

bool ReceiveInviteMessage(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x0C;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	bool success;
	uint8_t data;
	uint32_t StartTime, CurrentTime;

	success = false;

	//Build and load the joint request message to the FIFO transmit buffer
	//Always reset TxFIFO before building any message


	// Use these if delay is too long in the next function.
	ResetFIFO(Tx);
	BuildJoinRequestMsg(&RadioTransmitBuffer[0]);
	UploadMessage(JOIN_REQUEST_MESSAGE_LEN);



	data = SYNC_4_BYTE;//SKIP_TX + SYNC_4_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
	data = 0x80;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);

	ResetFIFO(Rx);										//Seems redundant. Remove it and test
	Read_RadioInterruptStatus();
	SyncDetected = false;
	wait_syncMatch(0);  // ensure sync detect flag is reset
	StartTime = GetCurrentTimerCount();
	StartRadioRx(CHANNEL_0, 3, READYSTATE);
	wait_syncMatch(5000);  // wait up to 5 seconds for sync detect
	do
	{
		Read_RadioInterruptStatus();
		CurrentTime = GetCurrentTimerCount();
	}while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<(uint32_t)(FIVE_SECOND)) );


	if(RadioReceiveBuffer[2] & 0x10)
	{
		DownloadMessage(3);

		if( (RxData[0] & INVITING_BIT) != 0)
		{
			success = true;
		}
	}
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x8C;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	return success;
}



/*******************************************************************************
 * \brief	Send join request message.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void SendJoinRequestMessage(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x0D;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t  data;
    //ABR added
    uint32_t StartTime, CurrentTime;

