Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
	//Radio chip does not transmit unless sync is transmitted. (bug in radio revB)
	data = SYNC_1_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x00;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);

    //ABR added
    StartTime = GetCurrentTimerCount();

	StartRadioTx(CHANNEL_0, JOIN_REQUEST_MESSAGE_LEN, READYSTATE, NO_RETRANSMIT);
	do
	{
		Read_RadioInterruptStatus();
        CurrentTime = GetCurrentTimerCount();
	}while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<20) );//ABR takes <3msec, we give it 10msec for testing
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x8D;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Receive join Ack message.
 *
 * \param	None.
 * \return	True, if join Ack received. False, if not.
 ******************************************************************************/

bool ReceiveJoinAckMessage(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x0E;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	bool success;
	uint8_t  data;
	uint32_t StartTime, CurrentTime;

	success = false;

	// The 2 bytes sync was sufficient. Do not use SKIP_TX. This will cause the Radio to malfunction
	data = SYNC_2_BYTE;//SKIP_TX + SYNC_2_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0xC0;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);


	ResetFIFO(Rx);
	Read_RadioInterruptStatus();
	StartRadioRx(CHANNEL_0, JOIN_ACK_MESSAGE_LEN, READYSTATE);//One byte less in this case
	StartTime = GetCurrentTimerCount();
	CurrentTime = StartTime;

	while( !success && ((CurrentTime-StartTime)<(20)) )//10msec window
	{
		CurrentTime = GetCurrentTimerCount();
		ResetFIFO(0);
		if(RxFifoCount<JOIN_ACK_MESSAGE_LEN)
		{
			continue;
		}
		else
		{
			DownloadMessage(JOIN_ACK_MESSAGE_LEN);
			if(RxData[1] == MSG_JOINACK)
			{
				CRCInit();
				CRCByte(MSG_LEN_LONG);
				for (uint8_t i=0; i<JOIN_ACK_MESSAGE_LEN; i++)
				{
					CRCByte(RxData[i]);
				}

				if( GetCRC()==CRC_CHECK )
				{
					SID = RxData[2] & SID_MASK;
					RumorSenderSID = RxData[0] & SID_MASK;
					MeshKey[0] = RxData[3];
					MeshKey[1] = RxData[4];
					MeshKey[2] = RxData[5];
					CopyMap(SIDMap,&RxData[6],MAP_DITHER);
					SetBit(SIDMap,SID);

					NetworkMeshID = MeshKey[0] & ID_MASK;
					TrueMID = NetworkMeshID;
					LongMsgFirstByte = (NetworkMeshID<<2)+MSG_LEN_LONG;
					MediumMsgFirstByte = (NetworkMeshID<<2)+MSG_LEN_MEDIUM;

					//Only update the SID before calling Ok message which will call GetKeys. At this
					//stage MeshID and CRC still need to be initialised to 0, but new SID required
					UpdateSID(SID);

					ResetFIFO(Tx);
					BuildOkMsg(&RadioTransmitBuffer[0]);
					for(uint8_t i=0; i<5; i++)
					{
						UploadMessage(OK_MESSAGE_LEN);
						SendOkMessage();
					}

					//Now update MeshKeys as well
					UpdateKeys(&MeshKey[0]);

					ClearMap(NbrMap);
					SetBit(NbrMap,RumorSenderSID);
					//PRINTF("Joined network %d as %d %d %d \r\n",MeshKey[0],SID,SIDMap[0],SIDMap[1]);

					//ReasonsForRumor |= (REASON_CHECK_NBRS | REASON_JOINED);	// neighbour check is higher priority and will happen first
					ReasonsForRumor |= REASON_JOINED;

					//Save mesh information here
					SaveMeshInfo();
#if SCRAMBLED_WISAFE
					// ABR Scramble
					Scramble0 = MeshKey[1];
#endif

					success = true;
				}
			}
		}
	}

	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x8E;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	return success;
}



/*******************************************************************************
 * \brief	Send Ok message.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void SendOkMessage(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x0F;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t  data;
    //ABR added
    uint32_t StartTime, CurrentTime;

	//Radio chip does not transmit unless sync is transmitted
	data = SYNC_1_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x00;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);

    //ABR added
    StartTime = GetCurrentTimerCount();

	StartRadioTx(CHANNEL_0, OK_MESSAGE_LEN, READYSTATE, NO_RETRANSMIT);
	do
	{
		Read_RadioInterruptStatus();
        CurrentTime = GetCurrentTimerCount();
	}while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<10) );//ABR takes 1mesc, we give it 5msec for testing
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x8F;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Receive Ok message.
 *
 * \param	TimeLeft. Time left for receive.
 * \return	SID of the Ok message sender.
 ******************************************************************************/

uint8_t RceiveOkMessage(uint32_t TimeLeft)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x10;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t	sid = NULL_SID;
	uint8_t	data;
	uint32_t StartTime, CurrentTime;

	Read_RadioInterruptStatus();
	data = SKIP_TX + SYNC_4_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
	data =  ReverseByte((NetworkMeshID<<2)+MSG_LEN_SHORT);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);

	StartRadioRx(CHANNEL_0, 1, TX_TUNE_STATE);//Receive Ok. No need to receive and check CRC bytes. Quick response needed.

