Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
	StartTime = GetCurrentTimerCount();
	do
	{
		Read_RadioInterruptStatus();
		CurrentTime = GetCurrentTimerCount();
	}
	while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<TimeLeft) );

	if(RadioReceiveBuffer[2] & 0x10)
	{
		DownloadMessage(1);
		sid = RxData[0]&SID_MASK;
	}

#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x90;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	return sid;
}



/*******************************************************************************
 * \brief	Receive rumour Ack message.
 *
 * \param	id. SID of expected rumour Acking node.
 * \return	True, if correct Ack received. False, if not.
 ******************************************************************************/

bool ReceiveRumourAckMessage(uint8_t id)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x11;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	bool success;
	uint8_t  data;
	uint32_t StartTime, CurrentTime;

	success = false;

	data = SKIP_TX + SYNC_4_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
	data = ReverseByte(MediumMsgFirstByte);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);

	StartTime = GetCurrentTimerCount();
	CurrentTime = StartTime;
	while( !success && ((CurrentTime-StartTime)<(20)) )//10msec window
	{
		Read_RadioInterruptStatus();
		StartRadioRx(CHANNEL_0, RUMOUR_ACK_MESSAGE_LEN, READYSTATE);//One byte less in this case
		do
		{
			Read_RadioInterruptStatus();
			CurrentTime = GetCurrentTimerCount();
		}
		while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<20) );

		if(RadioReceiveBuffer[2] & 0x10)
		{
			DownloadMessage(RUMOUR_ACK_MESSAGE_LEN);
			CRCInit();
			CRCByte(MediumMsgFirstByte);
			for (uint8_t i=0; i<RUMOUR_ACK_MESSAGE_LEN; i++)
			{
				CRCByte(RxData[i]);
			}
			if( GetCRC()==CRC_CHECK )
			{
				if((RxData[0]&SID_MASK)==id)
				{
					success = true;
					//PowerRcvBuf2 = RxData[1];	// first time, record some of message bytes
					//PowerRcvBuf3 = RxData[2];
					//PowerRcvBuf4 = RxData[3];
					//PowerRcvBuf5 = RxData[4];

					rcvbuf[0] = MediumMsgFirstByte;
					for(uint8_t i=1; i<=PROPAGATE_ACK_MESSAGE_LEN; i++)
					{
						rcvbuf[i] = RxData[i-1];
					}
				}
			}
		}
	}
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x91;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    return success;
}



/*******************************************************************************
 * \brief	Receive propagate Ack message.
 *
 * \param	id. SID of expected propagate Acking node.
 * \return	True, if correct Ack received. False, if not.
 ******************************************************************************/

bool ReceivePropagateAckMessage(uint8_t id)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x12;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	bool success;
	uint8_t  data;
	uint32_t StartTime, CurrentTime;

	success = false;

	data = SKIP_TX + SYNC_4_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
	data = ReverseByte(MediumMsgFirstByte);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);

	StartTime = GetCurrentTimerCount();
	CurrentTime = StartTime;
	while( !success && ((CurrentTime-StartTime)<(20)) )//10msec window
	{
		Read_RadioInterruptStatus();
		StartRadioRx(CHANNEL_0, PROPAGATE_ACK_MESSAGE_LEN, READYSTATE);//One byte less in this case
		do
		{
			Read_RadioInterruptStatus();
			CurrentTime = GetCurrentTimerCount();
		}
		while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<20) );

		if(RadioReceiveBuffer[2] & 0x10)
		{
			DownloadMessage(PROPAGATE_ACK_MESSAGE_LEN);
			CRCInit();
			CRCByte(MediumMsgFirstByte);
			for (uint8_t i=0; i<PROPAGATE_ACK_MESSAGE_LEN; i++)
			{
				CRCByte(RxData[i]);
			}
			if( GetCRC()==CRC_CHECK )
			{
				if((RxData[0]&SID_MASK)==id)
				{
					success = true;
					//PowerRcvBuf2 = RxData[1];	// first time, record some of message bytes
					//PowerRcvBuf3 = RxData[2];
					//PowerRcvBuf4 = RxData[3];
					//PowerRcvBuf5 = RxData[4];

					rcvbuf[0] = MediumMsgFirstByte;
					for(uint8_t i=1; i<=PROPAGATE_ACK_MESSAGE_LEN; i++)
					{
						rcvbuf[i] = RxData[i-1];
					}
				}
			}
		}
	}
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
        WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x92;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	return success;
}



/*******************************************************************************
 * \brief	Send a chirp message.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void Chirp(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x13;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t data;
    //ABR added
    uint32_t StartTime, CurrentTime;

	RadioTransmitBuffer[0] = 0x2A;//0xAA
	RadioTransmitBuffer[1] = 0xAA;
	RadioTransmitBuffer[2] = 0xAA;
	RadioTransmitBuffer[3] = 0xA8;

	UploadMessage(CHIRP_MESSAGE_LEN);

	data = SKIP_TX + SYNC_3_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = ReverseByte(NetworkMeshID<<2);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);

	Read_RadioInterruptStatus();
    //ABR added
    StartTime = GetCurrentTimerCount();

	StartRadioTx(CHANNEL_0, CHIRP_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit chirp
	do
	{
		Read_RadioInterruptStatus();
        CurrentTime = GetCurrentTimerCount();
	}
	while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<6) );//ABR takes 1/2 msec, we give it 3msec for testing 
	Read_RadioInterruptStatus();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x93;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



