Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
/*******************************************************************************
 * \brief	Receive a message.
 *
 * \param	None.
 * \return	True, message received. False, if not.
 ******************************************************************************/

bool ChirpToReceive(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x14;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	bool success;
	uint8_t data;
	uint32_t StartTime, CurrentTime;

	uint8_t RumorMsgByte;
	uint8_t RumorSenderSID;
	uint8_t RumorInitiatorSID;
	bool RumorOldNews;										// sender tells us if we have already heard the rumour


	if((ShortChirpCount<SHORT_CHIRP_COUNT) || (ReasonForCurrentRumor!=0))
	{
		// send short chirp
		ShortChirpCount++;
		//Chirp(); will be sent below as part of receiving a message
	}
	else
	{
		// send long chirp (Ok) every 90 seconds
		ShortChirpCount = 0;
		ResetFIFO(Tx);
		BuildOkMsg(&RadioTransmitBuffer[0]);				// send whole OK message
		UploadMessage(OK_MESSAGE_LEN);
		SendOkMessage();
	}


	success = false;

	ResetFIFO(Tx+Rx);
	//////////////////////////////Chirp message////////////////
	RadioTransmitBuffer[0] = 0x2A;//0xAA
	RadioTransmitBuffer[1] = 0xAA;
	RadioTransmitBuffer[2] = 0xAA;
	RadioTransmitBuffer[3] = 0xA8;

	UploadMessage(CHIRP_MESSAGE_LEN);


	//The following will be used in detecting Chirp response, 4 bytes is too stringent.
	/*
	data = SKIP_TX + SYNC_4_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
	data = ReverseByte(NetworkMeshID<<2);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);
	*/
	data = SKIP_TX + SYNC_3_BYTE;
	SetRadioProperty (SYNC, SYNC_CONFIG, data);
	data = 0x55;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
	data = 0x95;
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
	data = ReverseByte(NetworkMeshID<<2);
	SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);

#if 1
	//Read_RadioInterruptStatus();
    //ABR added
    StartTime = GetCurrentTimerCount();

	StartRadioTx(CHANNEL_0, CHIRP_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit chirp
	do
	{
		Read_RadioInterruptStatus();
        CurrentTime = GetCurrentTimerCount();
	}
	while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<6) );
#else
	//Using the NIRQ is unreliable.Probably because of glitches on the line causing unreal interrupts.
#endif

	////////////////////////////Chirp response///////////////////////
	StartRadioRx(CHANNEL_0, 0, TX_TUNE_STATE);//Receive chirp response.
	SyncDetected = false;
	StartTime = GetCurrentTimerCount();
	BuildOkMsg(&RadioTransmitBuffer[0]);
	UploadMessage(OK_MESSAGE_LEN);
	do
	{
		CurrentTime = GetCurrentTimerCount();
	}
	while( (!SyncDetected) && ((CurrentTime-StartTime)<12) );

	/*
	//For this to this to work, a minimum of 1 byte needs to be received at StartRadioRx above
	do
	{
		Read_RadioInterruptStatus();
		CurrentTime = GetCurrentTimerCount();
	}
	while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<12) );
	*/

	if(SyncDetected)
	{
		/////////////////////////Ok message///////////////////////
#if 1
		//Read_RadioInterruptStatus();
        //ABR added
        StartTime = GetCurrentTimerCount();

		StartRadioTx(CHANNEL_0, OK_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit OK

		// some node is listening (we received chirp response) - we can't spread a rumour right now
		ReasonForCurrentRumor = 0;				// somebody out there is in listen mode! can't spread a rumour

		data = SKIP_TX + SYNC_4_BYTE;
		SetRadioProperty (SYNC, SYNC_CONFIG, data);
		data = 0x55;
		SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
		data = 0x55;
		SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
		data = 0x95;
		SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
		data = ReverseByte(LongMsgFirstByte);
		SetRadioProperty (SYNC, SYNC_BITS_BYTE_4, data);

		do
		{
			Read_RadioInterruptStatus();
            CurrentTime = GetCurrentTimerCount();
		}
		while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<10) );
#else
		//Using the NIRQ is unreliable.Probably because of glitches on the line causing unreal interrupts.
#endif

		//Read_RadioInterruptStatus();

		////////////////////////Receive message///////////////////

		StartRadioRx(CHANNEL_0, JOIN_ACK_MESSAGE_LEN, TX_TUNE_STATE);	//Receive message. All expected messages here are
																		//of 17bytes. 1st byte used as sync, so only 16 left
		StartTime = GetCurrentTimerCount();
		do
		{
			Read_RadioInterruptStatus();
			CurrentTime = GetCurrentTimerCount();
		}
		while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTime)<12) );


		if(RadioReceiveBuffer[2] & 0x10)
		{
			DownloadMessage(JOIN_ACK_MESSAGE_LEN);
			CRCInit();
			CRCByte(LongMsgFirstByte);
			rcvbuf[0] = LongMsgFirstByte;
			for (uint8_t i=0; i<JOIN_ACK_MESSAGE_LEN; i++)
			{
				CRCByte(RxData[i]);
				rcvbuf[i+1] = RxData[i];
			}

			if( (GetCRC()==CRC_CHECK) && ((rcvbuf[2]&MSG_RUMOR_BIT)!=0) )
			{
				RumorSenderSID = rcvbuf[1]&SID_MASK;			// SID of node sending us this rumour
				RumorOldNews = ((rcvbuf[1]&OLD_NEWS_BIT)!=0);	// rumour sender sets bit if we have already seen this rumour
				RumorMsgByte = rcvbuf[2];						// extract message byte
				RumorInitiatorSID = rcvbuf[3]&SID_MASK;			// SID of rumour initiator
				RumorByte5 = rcvbuf[5];							// in case is targeted map request or status request rumour
				RumorByte6 = rcvbuf[6];							// used for MapMsgType and Rev12 indicator
				//RumorSenderSID = RxData[0];

				//////////////////////Send Rumour Ack Message//////////////
				ResetFIFO(Tx);									//Not needed, but to make sure TxFIFO is empty.
				BuildRumorAckMsg(&RadioTransmitBuffer[0]);
				UploadMessage(RUMORACK_MESSAGE_LEN);

				//Read_RadioInterruptStatus();//Not needed as the transmit complete flag is cleared while RadioRx above
                //ABR added
                StartTime = GetCurrentTimerCount();

				StartRadioTx(CHANNEL_0, RUMORACK_MESSAGE_LEN, READYSTATE, NO_RETRANSMIT);//Transmit Rumour Ack Message
				do
				{
					Read_RadioInterruptStatus();
                    CurrentTime = GetCurrentTimerCount();
				}
				while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTime)<12) );

				// Propagate request message detection code
				if(RumorInitiatorSID==SID)
				{
					;// we initiated this rumour - no need to process it
				}
				else if(RumorMsgByte==MSG_JOINED)
				{
					// rumour is about new node joining, or a neighbour update from an old node
					if(!TestBit(SIDMap,RumorInitiatorSID))
					{
						// this is a new node - we should tell it our NbrMap eventually
						BroadcastNbrMap = true;							// next time we check neighbours, broadcast results
						SetBit(SIDMap,RumorInitiatorSID);				// make sure existence marked */
					}

