Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
					// add connections. NOTE - for WiSafe2, last byte of map is actually remote SDAlarmIdent[0]
					// so last byte of map must be ignored by UpdateConnections

					//CopyMap(&rcvbuf[MSG_OFFSET_MAP],&rcvbuf[MSG_OFFSET_MAP],MAP_DITHER);		// undither neighbour map in place
					//UpdateConnections(RumorInitiatorSID,&rcvbuf[MSG_OFFSET_MAP]);				// NbrMap for new node (last byte ignored!)

					// save mesh info now that SIDMap has changed
					SaveMeshInfo();									// in case we reset, we can recover with new node

					// generate message to tell SD about new node (if not old news)
					if((OutgoingMsgLen==0) && (!RumorOldNews))
					{
						OutgoingMsg[0] = SPIMSG_RM_EXTENDED_RESPONSE;
						OutgoingMsg[1] = SPIMSG_EXTD_OPT_REMOTE_ID;		// new node report */
						OutgoingMsg[2] = RumorInitiatorSID;				// remote SID
						OutgoingMsg[3] = rcvbuf[MSG_OFFSET_MAP+7];		// eighth byte of map is remote SDAlarmIdent[0]
						OutgoingMsg[4] = rcvbuf[5];						// remote SDAlarmIdent[1]
						OutgoingMsg[5] = rcvbuf[6];						// remote SDAlarmIdent[2]
						OutgoingMsgLen = 6;
					}
					SetBit(NbrMap,RumorSenderSID);
				}
				else if(RumorMsgByte==MSG_SIDMAP_UPDATE)
				{
					// rumour is about new SIDMap
					CopyMap(&rcvbuf[MSG_OFFSET_MAP],&rcvbuf[MSG_OFFSET_MAP],MAP_DITHER);		// undither neighbour map in place
					SIDMapUpdate(&rcvbuf[MSG_OFFSET_MAP]);										// update all maps according to new SID map

					// generate message to tell SD about new SIDMap if not old news
					if((OutgoingMsgLen==0) && (!RumorOldNews))
					{
						OutgoingMsg[0] = SPIMSG_RM_EXTENDED_RESPONSE;
						OutgoingMsg[1] = SPIMSG_EXTD_OPT_SIDMAP_UPDATE;							// SIDMap update report
						CopyMap(&OutgoingMsg[2],SIDMap,0);										// 8 bytes
						OutgoingMsgLen = 10;
					}
				}
				else if(RumorMsgByte==MSG_SD_RUMOR)
				{
					// this is an SD transparent rumour
					// if this is an old rumour still drifting around, ignore it, since we have already told SD about it
					uint8_t RumorSeq;

					RumorSeq = SeqField(rcvbuf[4]);												// sequence number of current rumour
					if(RumorOldNews)
					{
						//PRINTF("OLD NEWS\n\r");// rumour sender has told us that we have already seen this rumour
					}
					else
					{
						// now tell SD about this rumour since it is new news
						CopyMap(OutgoingMsg,&rcvbuf[MSG_OFFSET_MAP],MAP_DITHER);				// copy and undither message
						OutgoingMsg[8] = rcvbuf[MSG_OFFSET_MAP-2];								// ninth byte stashed here
						OutgoingMsgLen = rcvbuf[MSG_OFFSET_MAP-1];								// length is just before message
						OutgoingMsg[OutgoingMsgLen++] = RumorInitiatorSID;						// append rumour initiator SID for SD
						OutgoingMsg[OutgoingMsgLen++] = RumorSeq;								// append sequence number of rumour for SD
						//PRINTF("RECEIVED %x. \n\r",OutgoingMsg[0]);
					}
					SetBit(NbrMap,RumorSenderSID);
				}
				else if((RumorMsgByte==MSG_STATUSREQ) && (SID==RumorByte5))
				{
					// targeted status request aimed at us! (target in byte 5 of incoming msg)
					ReasonsForRumor |= REASON_STATUS_REPLY;										// we'll send off our status when we get a chance
					StatusReplyTargetSID = RumorInitiatorSID;									// send results here
					SetBit(NbrMap,RumorSenderSID);
				}
				else if((RumorMsgByte==MSG_MAPREQ) && (SID==RumorByte5))
				{
					// targeted map request aimed at us! (target in byte 5 of incoming msg)
					ReasonsForRumor |= REASON_MAP_REPLY;										// we'll send off requested map when we get a chance
					MapReplyTargetSID = RumorInitiatorSID;										// send results here
					MapMsgType = RumorByte6;													// this byte from rumour contains type of map we should send
					SetBit(NbrMap,RumorSenderSID);
				}
				else if(RumorMsgByte==MSG_MAPREPLY)
				{
					// remote map data - pass to SD
					if(OutgoingMsgLen==0)
					{
						OutgoingMsg[0] = SPIMSG_RM_EXTENDED_RESPONSE;
						OutgoingMsg[1] = SPIMSG_EXTD_OPT_REMOTE_MAP;
						OutgoingMsg[2] = rcvbuf[MSG_OFFSET_MAP-1];								// map type is just before map
						CopyMap(&OutgoingMsg[3],&rcvbuf[MSG_OFFSET_MAP],MAP_DITHER);			// undither into outgoing message
						OutgoingMsg[11] = RumorInitiatorSID;									// append rumour initiator SID for SD
						OutgoingMsg[12] = SeqField(rcvbuf[4]);									// sequence number of current rumour
						OutgoingMsgLen = 13;
					}
					SetBit(NbrMap,RumorSenderSID);
				}
				else if(RumorMsgByte==MSG_STATUSREPLY)
				{
					// report status back to SD
					if (OutgoingMsgLen==0)
					{
						OutgoingMsg[0] = SPIMSG_RM_EXTENDED_RESPONSE;
						OutgoingMsg[1] = SPIMSG_EXTD_OPT_REMOTE_STATUS;							// remote status report
						OutgoingMsg[2] = RumorInitiatorSID;										// remote SID
						OutgoingMsg[3] = rcvbuf[5];												// VBAT unloaded
						OutgoingMsg[4] = rcvbuf[6];												// VBAT loaded
						// now 8 more values:	VBAT boosted loaded, last measured RSSI, FWREV,
						//						SDAlarmIdent[0..2], Critical Faults, Additional Info
						CopyMap(&OutgoingMsg[5],&rcvbuf[7],0);
						OutgoingMsgLen = 13;
					}
					SetBit(NbrMap,RumorSenderSID);
				}
				else if (RumorMsgByte==MSG_CONFIRM)
				{
					CopyMap(&rcvbuf[MSG_OFFSET_MAP],&rcvbuf[MSG_OFFSET_MAP],MAP_DITHER);		// undither map
					ProcessConfirmation(&rcvbuf[MSG_OFFSET_MAP],rcvbuf[5]);						// map in rcvbuf, RumorBuf[5] = oldttl????
					SetBit(NbrMap,RumorSenderSID);
				}
				success = true;
			}
		}
	}
	Read_RadioInterruptStatus();
	SetRadioProperty (INT_CTL, INT_CTL_ENABLE, NO_INT_EN);										// redundant
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x94;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	return success;
}



/*******************************************************************************
 * \brief	Transmit a message.
 *
 * \param	TimeLeft. Time left to transmit
 * \return	True, if rumour message transmitted. False, if not.
 ******************************************************************************/

bool ListenToTransmitPacket(uint16_t TimeLeft)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x40;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t chirpsdetected = 0;
	uint8_t okdetected = 0;
	uint8_t id;

	bool success;
	uint8_t data;
	uint8_t FirstByte;
	uint32_t StartTime, StartTimeNew, CurrentTime, TimeOut;

	success = false;
	TimeOut = (uint32_t)(TimeLeft<<8);//	x256 close to 250 as per the Timer.c IRQ handler

