Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
	FirstByte = ReverseByte((NetworkMeshID<<2)+MSG_LEN_SHORT);


	StartTime = GetCurrentTimerCount();
	CurrentTime = StartTime;

#if ENHANCED_DEBUG
	LOG_Info(LOG_YELLOW "TimeLeft = %d, TimeOut=%d, StartTime=%d",TimeLeft,TimeOut,StartTime);
#endif
	SyncDetected = true; //For first loop to load the chirp response data and prepare chirp as sync data

	while( !success && ((CurrentTime-StartTime)<TimeOut) )		//~3 second window
	{
#if ENHANCED_DEBUG
//		LOG_Info(LOG_YELLOW "CurrentTime=%d",CurrentTime);
#endif
		//Note: set 0x1210 to 0x80 so that Tx is not corrupted when no Preamble and Sync are transmitted
		if(SyncDetected)
		{
			ResetFIFO(Tx);


#if 1
			//It seems better if exactly 28bit preamble is sent
			RadioTransmitBuffer[0] = 0x2A;//0xAA
			RadioTransmitBuffer[1] = 0xAA;
			RadioTransmitBuffer[2] = 0xAA;
			RadioTransmitBuffer[3] = 0xA9;
			RadioTransmitBuffer[4] = ((MeshKey[0]<<2) + MSG_LEN_TINY);

			UploadMessage(0x05);
#else
				RadioTransmitBuffer[0] = 0xAA;
				RadioTransmitBuffer[1] = 0xAA;
				RadioTransmitBuffer[2] = 0xA9;
				RadioTransmitBuffer[3] = ((MeshKey[0]<<2) + MSG_LEN_TINY);

				UploadMessage(0x04);
#endif

			//Listen for a chirp
			data = SKIP_TX + SYNC_3_BYTE;
			SetRadioProperty (SYNC, SYNC_CONFIG, data);
			data = 0x55;									//Reversed 0xAA
			SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
			SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
			data = 0x15;									//Reversed 0xA8
			SetRadioProperty (SYNC, SYNC_BITS_BYTE_3, data);
		}

		SyncDetected = false;
		wait_syncMatch(0);  // ensure sync detect is reset
		Read_RadioInterruptStatus();
		StartRadioRx(CHANNEL_0, 0, TX_TUNE_STATE);////////////// Receive chirp //////////////////

#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x41;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
		wait_syncMatch((TimeOut+rand()%500)/2);  // wait for sync detection

#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x42;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
		if(SyncDetected)
		{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x43;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
			chirpsdetected++;
#if 1
			///////////////// Transmit chirp response /////////////////
#if 1
            //ABR added
            StartTimeNew = GetCurrentTimerCount();

			StartRadioTx(CHANNEL_0, 0x05, RX_TUNE_STATE, NO_RETRANSMIT);
#else
			StartRadioTx(CHANNEL_0, 0x04, RX_TUNE_STATE, NO_RETRANSMIT);
#endif
			Read_RadioInterruptStatus();
			data = SKIP_TX + SYNC_2_BYTE;
			SetRadioProperty (SYNC, SYNC_CONFIG, data);
			data = 0x95;
			SetRadioProperty (SYNC, SYNC_BITS_BYTE_1, data);
			data =  FirstByte;		//ReverseByte((NetworkMeshID<<2)+MSG_LEN_SHORT);
			SetRadioProperty (SYNC, SYNC_BITS_BYTE_2, data);
			do
			{
				Read_RadioInterruptStatus();
                CurrentTime = GetCurrentTimerCount();
			}
			while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTimeNew)<12) );
#else
			//NIRQ not working properly.
#endif
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x44;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
			//Listen for Ok message
			StartRadioRx(CHANNEL_0, 3, TX_TUNE_STATE);//Receive Ok. No need to receive and check CRC bytes. Quick response needed.

			ResetFIFO(Tx);
			//BuildRumorMessage(&RadioTransmitBuffer[0], CurrentMessage);
			CopyMemory(&RadioTransmitBuffer[0],&msgbuf[0],RUMOR_MESSAGE_LEN);
			UploadMessage(RUMOR_MESSAGE_LEN);

			StartTimeNew = GetCurrentTimerCount();
			do
			{
				Read_RadioInterruptStatus();
				CurrentTime = GetCurrentTimerCount();
			}
			while( !(RadioReceiveBuffer[2] & 0x10) && ((CurrentTime-StartTimeNew)<12) );
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x45;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

			DownloadMessage(3);
			id = RxData[0] & SID_MASK;

			/*
			//Need to use above to make sure we transmit after receiving all data bytes
			SyncDetected = false;
			StartTimeNew = GetCurrentTimerCount();
			do
			{
				//SyncDetected = Read_SyncDetectStatus();
				CurrentTime = GetCurrentTimerCount();
			}
			while( (!SyncDetected) && ((CurrentTime-StartTimeNew)<20) );
			*/

			//need to read the Rx FIFO and check if the SID is part of the RumorMap?
			//if(SyncDetected)//&& SID is part of RumorMap)
			if( (RadioReceiveBuffer[2] & 0x10) && TestBit(SIDMap,id) )
			{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x46;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
				okdetected++;
				SetBit(NbrMap,id);
				//Send the rumour

				if((ReasonForCurrentRumor!=REASON_PROPAGATE_RUMOR) && TestBit(RumorMap,id))
				{
					PatchMsgWithOldNews(false);						// rumour is new to this node, so make sure "old news" bit is cleared
					Delay(1);										// Do not change the 1msec delay. Looks like it is optimum time to makes the rumour message received by the RM.
					Read_RadioInterruptStatus();
                    //ABR added
                    StartTimeNew = GetCurrentTimerCount();
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x47;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

					StartRadioTx(CHANNEL_0, RUMOR_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit rumour message
					do
					{
						Read_RadioInterruptStatus();
                        CurrentTime = GetCurrentTimerCount();
					}
					while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTimeNew)<20) );
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x48;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
					//if(ReceiveRumourAckMessage(id) && AckRumorForUs(id))
					if( (ReceiveRumourAckMessage(id) && AckRumorForUs(id)) || ((ReasonsForRumor&REASON_STATUS_REQUEST)!=0) )//ABR modified
					{
						ClearBit(RumorMap,id);
						// note - could keep count of bits in RumorMap for faster
						if (CountBits(RumorMap)==0)
						{
							ListenTimeLeft = 0;						// can stop listening early
						}
						success = true;
					}
				}
				else if((ReasonForCurrentRumor==REASON_PROPAGATE_RUMOR) && TestBit(PropagateMap,id))
				{
					if (TestBit(RumorMap,id))
					{
						PatchMsgWithOldNews(false);						// rumour is new to this node, so make sure "old news" bit is cleared
					}
					else
					{
						PatchMsgWithOldNews(true);						// rumour is not new to this node, so make sure "old news" bit is set
					}
					Delay(1);										// Do not change the 1msec delay. Looks like it is optimum time to makes the rumour message received by the RM.
					Read_RadioInterruptStatus();
                    //ABR added
                    StartTimeNew = GetCurrentTimerCount();

#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x49;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
					StartRadioTx(CHANNEL_0, RUMOR_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit rumour message
					do
					{
						Read_RadioInterruptStatus();
                        CurrentTime = GetCurrentTimerCount();
					}
					while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTimeNew)<20) );
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4A;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

