Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
					if(ReceiveRumourAckMessage(id) && AckRumorForUs(id))
					{
						ClearBit(RumorMap,id);
						// note - could keep count of bits in RumorMap for faster
						if (CountBits(RumorMap)==0)
						{
							ReasonsForRumor &= ~REASON_PROPAGATE_RUMOR;
							ReasonForCurrentRumor = REASON_SPREAD_RUMOR;
							ReasonsForRumor |= ReasonForCurrentRumor;
							ListenTimeLeft = 0;						// can stop listening early
						}
						else
						{
							BuildPropagateMsg(id);
							CopyMemory(&RadioTransmitBuffer[0],&msgbuf[0],RUMOR_MESSAGE_LEN);
							UploadMessage(RUMOR_MESSAGE_LEN);
							Read_RadioInterruptStatus();
                            //ABR added
                            StartTimeNew = GetCurrentTimerCount();

#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4B;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
							StartRadioTx(CHANNEL_0, RUMOR_MESSAGE_LEN, RX_TUNE_STATE, NO_RETRANSMIT);//Transmit rumour message
							do
							{
								Read_RadioInterruptStatus();
                                CurrentTime = GetCurrentTimerCount();
							}
							while( !(RadioReceiveBuffer[2] & 0x20) && ((CurrentTime-StartTimeNew)<20) );
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4C;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

							if (PropagationAccepted(id))
							{
								// it worked!  other node will take over
								// we have successfully propagated out the rumour we had
								ReasonsForRumor &= ~ReasonForCurrentRumor;					// our reason has been satisfied
								ReasonForCurrentRumor = 0;									// rumour is gone
								ListenTimeLeft = 0;											// can stop listening early
							}
							else
							{
								// other node refused to propagate, or message got corrupted
								CopyRumorToMsg();											// attempt to propagate failed - reload rumour
							}
						}
						success = true;
					}
				}
			}
		}
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4D;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
		CurrentTime = GetCurrentTimerCount();
	}
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4E;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

	Read_RadioInterruptStatus();
	SetRadioProperty (INT_CTL, INT_CTL_ENABLE, NO_INT_EN);
	//PRINTF("Chirps=%d, Oks=%d  \r\n",chirpsdetected,okdetected);
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x4F;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
        return success;
}



/*******************************************************************************
 * \brief	Change radio operational state.
 *
 * \param	nextstate. Radio next state to be entered.
 * \return	None.
 ******************************************************************************/

void ChangeState(uint8_t nextstate)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x16;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
		RadioTransmitBuffer[0] = nextstate;

		//RadioCTS = Get_RadioCTS();
		//if( RadioCTS )
		do
		{
		  	RadioCTS = Get_RadioCTS();
		}
		while(!RadioCTS);

		Write_RadioCommand(0x34, 1, NO_RESPONSE_LEN);
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x96;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Start radio receive.
 *
 * \param	channel. Radio channel.
 * \param	len. Length of bytes to be received.
 * \param	nextstate. Radio state after receive completion.
 * \return	None.
 ******************************************************************************/

void StartRadioRx(uint8_t channel, uint8_t len, uint8_t nextstate)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x17;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

	ResetFIFO(Rx);

	RadioTransmitBuffer[0] = channel;
	RadioTransmitBuffer[1] = 0x00;
	RadioTransmitBuffer[2] = 0x00;
	RadioTransmitBuffer[3] = len;
	RadioTransmitBuffer[4] = NOCHANGESTATE;
	RadioTransmitBuffer[5] = nextstate;
	RadioTransmitBuffer[6] = NOCHANGESTATE;

	//RadioCTS = Get_RadioCTS();
	//if( RadioCTS )
	do
	{
	   	RadioCTS = Get_RadioCTS();
	}
	while(!RadioCTS);

	{
		Write_RadioCommand(START_RX, 7, NO_RESPONSE_LEN);
	}
	//else
	{
	   	//PRINTF("Error1. \r\n");
	}
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x97;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Start radio transmit.
 *
 * \param	channel. Radio channel.
 * \param	len. Length of bytes to be transmitted.
 * \param	nextstate. Radio state after transmit completed.
 * \param	retransmit. If 1, repeat last transmission. If 0, no retransmit.
 * \return	None.
 ******************************************************************************/

void StartRadioTx(uint8_t channel, uint8_t len, uint8_t nextstate, uint8_t retransmit)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x18;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	RadioTransmitBuffer[0] = channel;
	RadioTransmitBuffer[1] = (nextstate<<4) + retransmit;//Start TX immediately and switch to RX state when transmission completed
	RadioTransmitBuffer[2] = 0x00;
	RadioTransmitBuffer[3] = len;
	RadioTransmitBuffer[4] = 0x00;
	RadioTransmitBuffer[5] = 0x00;

	//RadioCTS = Get_RadioCTS();
	//if( RadioCTS )
	do
	{
	   	RadioCTS = Get_RadioCTS();
	}
	while(!RadioCTS);

	Write_RadioCommand(START_TX, 6, NO_RESPONSE_LEN);
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x98;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



