Sprue-Software/Gateway_Windows/MIMXRT1051xxxxB_Project/source/OSAL/RT1050/wisafe_drv/radio.c
/*******************************************************************************
 * \brief	Upload message to radio FIFO transmit buffer.
 *
 * \param	len. Length of bytes to be written.
 * \return	None.
 ******************************************************************************/

void UploadMessage(uint8_t len)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x19;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	//RadioCTS = Get_RadioCTS();
	//if( RadioCTS )
	do
	{
	   	RadioCTS = Get_RadioCTS();
	}
	while(!RadioCTS);

	{
		Write_RadioCommand(WRITE_TX_FIFO, len, NO_RESPONSE_LEN);
	}
	//else
	{
		//PRINTF("Upload Message failed \r\n");
	}
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x99;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Download message from radio FIFO receive buffer.
 *
 * \param	len. Length of bytes to be read.
 * \return	None.
 ******************************************************************************/

void DownloadMessage(uint8_t len)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x1A;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	//RadioCTS = Get_RadioCTS();
	//if( RadioCTS )
	do
	{
	   	RadioCTS = Get_RadioCTS();
	}
	while(!RadioCTS);

	ReadRxBuffer(len);

#if SCRAMBLED_WISAFE
	// ABR Scramble
	for(uint8_t count=3; count<len; count++)    //Only fifth (index 3 in RxData) byte onward in the received messages is scrambled
	{
		RxData[count] = RxData[count] ^ Scramble0;
	}
#endif
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x9A;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}



/*******************************************************************************
 * \brief	Reset radio FIFO buffersr.
 *
 * \param	rxtx. Buffer to be reset. Receive, transmit, or both.
 * \return	None.
 ******************************************************************************/

void ResetFIFO(uint8_t rxtx)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x1B;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	RadioTransmitBuffer[0] = rxtx;

	//Get_RadioCTS();
	//if( RadioCTS )
	do
	{
	   	RadioCTS = Get_RadioCTS();
	}
	while(!RadioCTS);

	Write_RadioCommand(FIFO_INFO, FIFO_INFO_COMMAND_LEN, FIFO_INFO_RESPONSE_LEN);

	RxFifoCount = RadioReceiveBuffer[0];
	TxFifoSpace = RadioReceiveBuffer[1];
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x9B;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
}


#if SCRAMBLED_WISAFE
/*******************************************************************************
 * \brief   Scramble messages for transmission.
 *
 * \param   type. Scrambling actual message buffer or a dummy buffer.
 * \return  None.
 ******************************************************************************/
void MsgScramble(uint8_t type)
{
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x1C;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
    if(type==1)
    {

        for (uint8_t i=8; i<=20; i++)
        {
            msgbuf[i] = msgbuf[i] ^ Scramble0;
        }

        /*
        //msgbuf[7] = msgbuf[7] ^ Scramble0;
        msgbuf[8] = msgbuf[8] ^ Scramble0;
        msgbuf[9] = msgbuf[9] ^ Scramble0;
        msgbuf[10] = msgbuf[10] ^ Scramble0;
        msgbuf[11] = msgbuf[11] ^ Scramble0;
        msgbuf[12] = msgbuf[12] ^ Scramble0;
        msgbuf[13] = msgbuf[13] ^ Scramble0;
        msgbuf[14] = msgbuf[14] ^ Scramble0;
        msgbuf[15] = msgbuf[15] ^ Scramble0;
        msgbuf[16] = msgbuf[16] ^ Scramble0;
        msgbuf[17] = msgbuf[17] ^ Scramble0;
        msgbuf[18] = msgbuf[18] ^ Scramble0;
        msgbuf[19] = msgbuf[19] ^ Scramble0;
        msgbuf[20] = msgbuf[20] ^ Scramble0;
        */
    }
    else if(type==2)
    {
        for (uint8_t i=8; i<=20; i++)
        {
            RadioTransmitBuffer[i] = RadioTransmitBuffer[i] ^ Scramble0;
        }
    }
    else
    {
        for (uint8_t i=8; i<=20; i++)
        {
            dummymsgbuf[i] = dummymsgbuf[i] ^ Scramble0;
        }
    }
#if ENHANCED_DEBUG
    //ABR added for testing
    WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x9C;
    WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif

}
#endif



/*******************************************************************************
 * \brief	Continuous transmit of modulation frequency.
 *
 * \param	None.
 * \return	None.
 ******************************************************************************/

void RadioContinuousTransmit(void)
{
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x1D;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	uint8_t newfreqfrac2, newfreqfrac3;
	uint16_t systimestart;
	uint8_t finestepchange = 5;


	//PRINTF("In continuous transmit mode.\n\r");

	systimestart = SysTime;
	newfreqfrac2 = FREQ_CONTROL_FRAC2_DEFAULT;
	newfreqfrac3 = FREQ_CONTROL_FRAC3_DEFAULT;

	RadioInContinuousTransmit = true;
	SetRadioProperty (MODEM_MOD_TYPE_GROUP, MODEM_MOD_TYPE_INDEX0, MOD_TYPE_CW);	// Continuous transmit
	ChangeState(TXSTATE);

	while( (SysTime-systimestart)<MINUTE_SYS_TIME_COUNT)
	{
		if(SDMsgRcvd == SPIMSG_RM_INC_FREQ)
		{
			//PRINTF("Increment frequency.\n\r");
			newfreqfrac2++;
			SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX2, newfreqfrac2);
			ChangeState(READYSTATE);
			ChangeState(TXSTATE);
			systimestart = SysTime;				// reset time for new one minute
			SDMsgRcvd = SPIMSG_NULL;
		}

		if(SDMsgRcvd == SPIMSG_RM_FINE_INC_FREQ)
		{
			//PRINTF("Fine increment frequency.\n\r");
			if(newfreqfrac3 <= (255-finestepchange))
			{
				newfreqfrac3 = newfreqfrac3 + finestepchange;
				SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX3, newfreqfrac3);
				ChangeState(READYSTATE);
				ChangeState(TXSTATE);
				systimestart = SysTime;				// reset time for new one minute
			}
			SDMsgRcvd = SPIMSG_NULL;
		}

		if(SDMsgRcvd == SPIMSG_RM_DEC_FREQ)
		{
			//PRINTF("Decrement frequency.\n\r");
			newfreqfrac2--;
			SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX2, newfreqfrac2);
			ChangeState(READYSTATE);
			ChangeState(TXSTATE);
			systimestart = SysTime;				// reset time for new one minute
			SDMsgRcvd = SPIMSG_NULL;
		}

		if(SDMsgRcvd == SPIMSG_RM_FINE_DEC_FREQ)
		{
			//PRINTF("Fine decrement frequency.\n\r");
			if(newfreqfrac3 >= finestepchange)
			{
				newfreqfrac3 = newfreqfrac3 - finestepchange;
				SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX3, newfreqfrac3);
				ChangeState(READYSTATE);
				ChangeState(TXSTATE);
				systimestart = SysTime;				// reset time for new one minute
			}
			SDMsgRcvd = SPIMSG_NULL;
		}


		if(SDMsgRcvd == SPIMSG_RM_EXIT_FREQ)
		{
			//PRINTF("Exit continuous transmit mode.\n\r");
			SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX2, FREQ_CONTROL_FRAC2_DEFAULT);
			SetRadioProperty (FREQ_CONTROL_FRAC_GROUP, FREQ_CONTROL_FRAC_INDEX3, FREQ_CONTROL_FRAC3_DEFAULT);
			SDMsgRcvd = SPIMSG_NULL;
			break;								//Exit while loop
		}

		if(SDMsgRcvd == SPIMSG_RM_SAVE_FREQ)
		{
			//PRINTF("Save and exit continuous transmit mode.\n\r");
			SaveFreqFrac(newfreqfrac2, newfreqfrac3);
			SDMsgRcvd = SPIMSG_NULL;
			break;								//Exit while loop
		}
	}

	SetRadioProperty (MODEM_MOD_TYPE_GROUP, MODEM_MOD_TYPE_INDEX0, MOD_TYPE_2GFSK);// back to normal 2GFSK transmit mode
	ChangeState(READYSTATE);
	RadioInContinuousTransmit = false;
#if ENHANCED_DEBUG
	//ABR added for testing
	WiSafe_RM_Task_Point[WiSafe_RM_Task_Point_Index] = 0x9D;
	WiSafe_RM_Task_Point_Index = (WiSafe_RM_Task_Point_Index + 1) % sizeof(WiSafe_RM_Task_Point);
#endif
	//PRINTF("Back to normal transmit mode.\n\r");
}




